"Aw crap" = "Aw paska";
"Back" = "Takaisin";
"Half full" = "Puoliksi täynnä";
"How ya feeling today?" = "Miten ya tunne tänään?";
"Live half full." = "Elää puoliksi täynnä.";
"Loading..." = "Ladataan ...";
"Next" = "Seuraava";
"No internet connection" = "Ei internet-yhteyttä";
"OK" = "Kunnossa";
"Patience is a virtue." = "Kärsivällisyys on hyve.";
"Share to Facebook" = "Jaa Facebookissa";
"Share to Twitter" = "Jaa Twitteriin";
"Sorry, this quote is too long to post to Twitter." = "Anteeksi, tämä lainaus on liian pitkä lähettää Twitteriin.";
"The app that turns your frown upside down with a dose of inspiration to kick any bad mood in the butt!" = "Sovellus, joka muuttaa paheksua ylösalaisin annos inspiraatiota potkia mitään huonoa mielialaa persettä!";
"The glass is always" = "Lasi on aina";
"The quote hasn't loaded yet." = "Lainaus ei ole vielä ladattu.";
"Try Again" = "Yritä uudelleen";
"Whoops" = "Oho";
"don't be angry." = "suuttunut";
"don't be impatient." = "kärsimätön";
"don't be tired." = "väsynyt";
"don't be lonely." = "yksinäinen";
"don't be depressed." = "masentunut";
"don't be guilty." = "syyllinen";
"don't be sad." = "surullinen";
"don't be nostalgic." = "nostalginen";
"don't be jealous." = "mustasukkainen";
"don't be dull." = "tylsä";
"don't be scared." = "pelästynyt";
"don't be anxious." = "innokas";
"angry" = "suuttunut";
"impatient" = "kärsimätön";
"tired" = "väsynyt";
"lonely" = "yksinäinen";
"depressed" = "masentunut";
"guilty" = "syyllinen";
"sad" = "surullinen";
"nostalgic" = "nostalginen";
"jealous" = "mustasukkainen";
"dull" = "tylsä";
"scared" = "pelästynyt";
"anxious" = "innokas";
